Homework/ComputerOrganization/Hw1/ComputerOrganizationHw1.tex
% Created 2019-02-01 Fri 21:50
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=0.5in]{geometry}
\author{Parker Gabel}
\date{\today}
\title{Computer Organization Homework 1}
\hypersetup{
 pdfauthor={Parker Gabel},
 pdftitle={Computer Organization Homework 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Problem 1}
\label{sec:orgd22e349}
\subsection{7544\(_{\text{ten}}\) = 0001110101111000}
\label{sec:orgfcaf14d}
\subsection{2974\(_{\text{ten}}\) = 0000101110011110}
\label{sec:org89f846e}
\subsection{-671\(_{\text{ten}}\) = 1111110101100001}
\label{sec:org5c3107c}
\section{Problem 2}
\label{sec:org22170bd}
\subsection{(j)}
\label{sec:org3092ec5}
a = 0000 1001 0010 1111
b = 0101 1100 0001 1100
\subsubsection{Hex}
\label{sec:orgd4458c3}
a = 92F
b = 5C1C
\subsubsection{Octal}
\label{sec:org1d9033f}
a = 4457
b = 56034
\subsubsection{a + b}
\label{sec:org853bc92}
a + b = 0110 0101 0010 1011
No Carry out or overflow
\subsubsection{a - b}
\label{sec:org3f7f2fc}
a - b = 0110 0101 0010 1011
No Carry out or overflow
\subsection{(k)}
\label{sec:org3f6ba94}
a = 0011 1001 1110 1111
b = 0011 1101 0010 0010
\subsubsection{Hex}
\label{sec:org03a9e01}
a = 39EF
b = 3D22
\subsubsection{Octal}
\label{sec:org58ee1a1}
a = 34757
b = 36442
\subsubsection{a + b}
\label{sec:orgd4c46df}
a + b = 0111 0111 0000 1001
No Carry out or overflow
\subsubsection{a - b}
\label{sec:org84cb714}
a - b = 1000 1110 0011 1000
Carry out not overflow
\subsection{(l)}
\label{sec:orgfe016dc}
a = 1111 0010 0010 0111
b = 0010 0011 0011 0011
\subsubsection{Hex}
\label{sec:org9d4ba09}
a = F227
b = 2333
\subsubsection{Octal}
\label{sec:orgd00030f}
a = 17104
b = 21463
\subsubsection{a + b}
\label{sec:org2a2eb8a}
a + b = 0110 1101 0011 1100
Overflow no carry out
\subsubsection{a - b}
\label{sec:orgbf4f06b}
a - b = 1000 1001 0101 1110
Overflow no carry out
\section{Problem 3}
\label{sec:org7683817}
\subsection{(i)}
\label{sec:orga8d7e1c}
add ribbon tonto hermit
\subsection{(j)}
\label{sec:org12b1a90}
   bne clear, falls, Else
   lw \$s3 1
   j exit
Else: lw \$s3 0
\subsection{(k)}
\label{sec:org987ee77}
add \$s0 3(tonto) kaibab
sub \$s6 \$s0 creek
lw \$t7 \$s6
\end{document}
